# Pandas Case Study-4

# Pandas Exercise: Grouping (OCCUPATION FILE)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [2]:
url='https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
df=pd.read_csv(url,sep='|')
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 3. Assign it to a variable called users.

In [3]:
users=df
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [4]:
users.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [5]:
users[['occupation','age']].groupby(['occupation']).mean().head()

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [9]:
df1=users.loc[(users['gender']=='M')& (users['occupation'])]
df1.head()

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
2        3   23      M         writer    32067
3        4   24      M     technician    43537
5        6   42      M      executive    98101
6        7   57      M  administrator    91344

In [18]:
i=df1.groupby(['gender','occupation']).gender.count()
j=df1.groupby(['gender']).gender.count()

In [19]:
(i/j).sort_values(ascending=False)

gender  occupation
M       student          0.202985
        educator         0.102985
        other            0.102985
        engineer         0.097015
        programmer       0.089552
        administrator    0.064179
        executive        0.043284
        scientist        0.041791
        technician       0.038806
        writer           0.038806
        librarian        0.032836
        marketing        0.023881
        entertainment    0.023881
        artist           0.022388
        retired          0.019403
        lawyer           0.014925
        salesman         0.013433
        doctor           0.010448
        healthcare       0.007463
        none             0.007463
        homemaker        0.001493
Name: gender, dtype: float64

In [22]:
#gender ratio(Male & female) per occupation
i=users.groupby(['gender','occupation']).gender.count()
j=users.groupby(['gender']).gender.count()
(i/j).sort_values(ascending=False)

gender  occupation
F       student          0.219780
M       student          0.202985
F       administrator    0.131868
        other            0.131868
        librarian        0.106227
M       other            0.102985
        educator         0.102985
        engineer         0.097015
F       educator         0.095238
M       programmer       0.089552
F       writer           0.069597
M       administrator    0.064179
F       artist           0.047619
M       executive        0.043284
        scientist        0.041791
F       healthcare       0.040293
M       writer           0.038806
        technician       0.038806
F       marketing        0.036630
M       librarian        0.032836
        marketing        0.023881
        entertainment    0.023881
        artist           0.022388
F       homemaker        0.021978
        programmer       0.021978
M       retired          0.019403
        lawyer           0.014925
F       none             0.014652
M       salesman         0.013433
F       executive        0.010989
        salesman         0.010989
        scientist        0.010989
M       doctor           0.010448
        healthcare       0.007463
        none             0.007463
F       lawyer           0.007326
        entertainment    0.007326
        engineer         0.007326
        retired          0.003663
        technician       0.003663
M       homemaker        0.001493
Name: gender, dtype: float64

### Step 6. For each occupation, calculate the minimum and maximum ages

In [9]:
users[['occupation','age']].groupby(['occupation']).agg(['min','max']).add_suffix('_age').head()

              age_age
              min_age max_age
occupation
administrator      21      70
artist             19      48
doctor             28      64
educator           23      63
engineer           22      70

### Step 7. For each combination of occupation and gender, calculate the mean age

In [10]:
users[['occupation','gender','age']].groupby(['occupation','gender']).mean().head()

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429

### Step 8.  For each occupation present the percentage of women and men

In [26]:
a=users.groupby(['occupation','gender']).agg({'gender':'count'})
b=users.groupby(['occupation']).agg('count')

In [30]:
percentage=a.div(b,level='occupation')*100
percentage.loc[:,'gender']

occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
educator       F          27.368421
               M          72.631579
engineer       F           2.985075
               M          97.014925
entertainment  F          11.111111
               M          88.888889
executive      F           9.375000
               M          90.625000
healthcare     F          68.750000
               M          31.250000
homemaker      F          85.714286
               M          14.285714
lawyer         F          16.666667
               M          83.333333
librarian      F          56.862745
               M          43.137255
marketing      F          38.461538
               M          61.538462
none           F          44.444444
               M          55.555556
other          F          34.285714
               M          65.714286
programmer     F           9.090909
               M          90.909091
retired        F           7.142857
               M          92.857143
salesman       F          25.000000
               M          75.000000
scientist      F           9.677419
               M          90.322581
student        F          30.612245
               M          69.387755
technician     F           3.703704
               M          96.296296
writer         F          42.222222
               M          57.777778
Name: gender, dtype: float64